import React, { useState } from 'react';
import { View, Text, FlatList, TouchableOpacity, StyleSheet, Button } from 'react-native';

const  HomePage=({ navigation })=> {
  const [countries, setCountries] = useState([
    { name: 'Исландия', anons: 'Вулканы и ледники', full: 'Исландия — молодая страна, образовавшаяся в результате вулканических извержений за последние 60 млн. лет. Через всю страну с севера на юго-запад простирается обширная зона, включая район Снайфедльснес на западе, большого числа вулканов. Из них 20 извергались уже после заселения страны. Наиболее характерны цепочки кратеров, возникших в результате извержений вдоль трещин и разломов.', img: require('../assets/islandia.jpg'), id: '1' },
    { name: 'Греция', anons: 'Античные руины и море', full: 'является одной из самых посещаемых стран Европы', full: 'Греция является одной из самых посещаемых стран Европы. И дело не только в том, что у нее прекрасные пляжи, подходящий для летнего отдыха климат и чистое море. Греция является музеем под открытым небом. Каждый город пропитан духом древности. Даже в самых небольших деревнях Греции можно найти развалины древней крепости или фрагменты античных храмов. Середина и конец мая являются лучшим временем для отдыха в Греции. В это время еще не жарко, туристов немного и уже можно купаться. Бархатный сезон в Греции - сентябрь и октябрь. В июле - августе лучше отдыхать на островах, там жара легче переносится из-за бриза.', img: require('../assets/islandia.jpg'), id: '2' },
    { name: 'Сингапур', anons: 'Высокие технологии и природа', full: 'здесь уживаются ультрасовременные небоскребы', full: 'Сингапур многолик – здесь уживаются ультрасовременные небоскребы с уголками времен колонизации. Большая часть культурных достопримечательностей расположена в столице, особенно в колониальном центре и этнических кварталах. Несмотря на то, что Сингапур – крупный промышленный и урбанизированный центр, здесь тщательно сохраняются природные богатства в многочисленных парках. Среди них следует выделить Национальный парк, птичий парк Джуронг, парк орхидей Мандай. Характерным отличием Сингапура от других азиатских городов является его абсолютная чистота, ухоженность и порядок. Ко всему этому стоит добавить захватывающие зрелища многочисленных ярких национальных и религиозных праздников разных народов Азии.', img: require('../assets/islandia.jpg'), id: '3' },
  ]);

  return (
    <View style={styles.container}>
      <Text style={styles.title}>Список стран</Text>
      <FlatList
        data={countries}
        keyExtractor={(item) => item.id}
        renderItem={({ item }) => (
          <TouchableOpacity
            style={styles.card}
            onPress={() => navigation.navigate('Details', { country: item })}
          >
            <Text style={styles.name}>{item.name}</Text>
            <Text style={styles.anons}>{item.anons}</Text>
          </TouchableOpacity>
        )}
      />
      {/* Кнопка для перехода в галерею */}
      <Button title="Перейти в галерею" onPress={() => navigation.navigate('Gallery')} />
    </View>
  );
}

const styles = StyleSheet.create({
  container: { flex: 1, padding: 20 },
  title: { fontSize: 24, fontWeight: 'bold', marginBottom: 20 },
  card: { padding: 15, backgroundColor: '#f8f8f8', marginBottom: 10, borderRadius: 5 },
  name: { fontSize: 18, fontWeight: 'bold' },
  anons: { fontSize: 14, color: '#555' },
});
export default HomePage;